[ {
  "id" : "ThanksForCreatingPullRequest",
  "data" : {
    "EN" : ":heart: Thanks for the <span class='notranslate'>pull request</span>! A sec please, we've already submitted it to CI, and will let you know once it's done!",
    "ZH_HANS" : ":heart: 感谢提交Pull Request！请稍等片刻，我们已经将其提交到CI进行检查，一旦有结果会立即通知您！",
    "ZH_HANT" : ":heart: 感謝提交Pull Request！請稍等片刻，我們已經將其提交到CI進行檢查，一旦有結果會立即通知您！",
    "ES" : ": corazón: ¡Gracias por la <span class='notranslate'>pull request</span> ! Un segundo, por favor, ya lo hemos enviado a CI y se lo haremos saber una vez que esté listo.",
    "AR" : ": القلب: شكرا <span class='notranslate'>pull request</span> ! لحظة من فضلك ، لقد أرسلناها بالفعل إلى CI ، وسنعلمك بمجرد الانتهاء!",
    "PT" : ": heart: Obrigado pelo <span class='notranslate'>pull request</span> ! Um segundo, já o submetemos ao CI e avisaremos quando estiver pronto!",
    "ID" : ":heart: Terima kasih atas <span class='notranslate'>pull request</span> ! Mohon sebentar, kami sudah mengirimkannya ke CI, dan akan memberi tahu Anda setelah selesai!",
    "FR" : ":heart: Merci pour la <span class='notranslate'>pull request</span> ! Une seconde s&#39;il vous plaît, nous l&#39;avons déjà soumis à CI, et vous le ferons savoir une fois que ce sera fait !",
    "JA" : "：heart： <span class='notranslate'>pull request</span>ありがとうございます！ちょっと待ってください、私たちはすでにそれをCIに提出しました、そしてそれが終わったらあなたに知らせます！",
    "RU" : ": heart: Спасибо за <span class='notranslate'>pull request</span> ! Секундочку, мы уже отправили его в CI и сообщим вам, как только он будет готов!",
    "DE" : ":heart: Danke für die <span class='notranslate'>pull request</span> ! Eine Sekunde bitte, wir haben es bereits an CI gesendet und werden Sie informieren, sobald es fertig ist!",
    "KO" : ": heart : <span class='notranslate'>pull request</span> 주셔서 감사합니다! 잠시만 기다려주세요. 이미 CI에 제출했으며 완료되면 알려 드리겠습니다!",
    "IT" : ":heart: Grazie per la <span class='notranslate'>pull request</span> ! Un secondo per favore, l&#39;abbiamo già inviato a CI e ti faremo sapere una volta terminato!"
  },
  "format" : "HTML"
}, {
  "id" : "YourAnswerIsBeingTested",
  "data" : {
    "EN" : ":smile: Your answer is being tested by CI. Click [here]({0}) to see more details.",
    "ZH_HANS" : ":smile: 您的答案正在被CI测试。点击[这里]({0})查看更多信息。",
    "ZH_HANT" : ":smile: 您的答案正在被CI測試。點擊[這裡]({0})查看更多信息。",
    "ES" : ": smile: CI está probando su respuesta. Haga clic [aquí] ({0}) para ver más detalles.",
    "AR" : ": ابتسم: يتم اختبار إجابتك بواسطة CI انقر [هنا] ({0}) لمشاهدة المزيد من التفاصيل.",
    "PT" : ": smile: Sua resposta está sendo testada pelo CI. Clique [aqui] ({0}) para ver mais detalhes.",
    "ID" : ":smile: Jawaban Anda sedang diuji oleh CI. Klik [di sini]({0}) untuk melihat detail selengkapnya.",
    "FR" : ":smile: Votre réponse est testée par CI. Cliquez [ici]({0}) pour voir plus de détails.",
    "JA" : "：smile：あなたの答えはCIによってテストされています。詳細については、[こちら]（{0}）をクリックしてください。",
    "RU" : ": smile: Ваш ответ проверяется CI. Нажмите [здесь] ({0}), чтобы увидеть более подробную информацию.",
    "DE" : ":smile: Ihre Antwort wird von CI getestet. Klicken Sie [hier]({0}), um weitere Details anzuzeigen.",
    "KO" : ": 미소 : 귀하의 답변은 CI에서 테스트 중입니다. 자세한 내용을 보려면 [여기] ({0})를 클릭하세요.",
    "IT" : ":smile: La tua risposta è in fase di test da CI. Fare clic [qui]({0}) per visualizzare maggiori dettagli."
  },
  "format" : "TEXT"
}, {
  "id" : "YourAnswerPassedCI",
  "data" : {
    "EN" : ":tada: Congrats! Your answer passed our CI test. I will merge the <span class='notranslate'>pull request</span> for you. Please keep challenging and enjoy programming!\nClick [here]({0}) to see more details.\n",
    "ZH_HANS" : ":tada: 恭喜！您的答案通过了CI测试。请再接再厉，继续挑战，享受编程的乐趣！\n点击[这里]({0})查看更多信息。\n",
    "ZH_HANT" : ":tada: 恭喜！您的答案通過了CI測試。請再接再厲，繼續挑戰，享受編程的樂趣！點擊[這裡]({0})查看更多信息。",
    "ES" : ": tada: ¡Felicidades! Su respuesta pasó nuestra prueba de CI. Combinaré la <span class='notranslate'>pull request</span> por ti. ¡Sigue desafiando y disfruta de la programación! Haga clic [aquí] ({0}) para ver más detalles.",
    "AR" : ": تادا: مبروك! اجتاز إجابتك اختبار CI الخاص بنا. سأقوم بدمج <span class='notranslate'>pull request</span> أجلك. يرجى الاستمرار في التحدي والاستمتاع بالبرمجة! انقر [هنا] ({0}) لمشاهدة المزيد من التفاصيل.",
    "PT" : ": tada: Parabéns! Sua resposta passou em nosso teste de CI. Vou mesclar a <span class='notranslate'>pull request</span> para você. Continue desafiando e aproveite a programação! Clique [aqui] ({0}) para ver mais detalhes.",
    "ID" : ":tada: Selamat! Jawaban Anda lulus tes CI kami. Saya akan menggabungkan <span class='notranslate'>pull request</span> untuk Anda. Harap tetap menantang dan menikmati pemrograman! Klik [di sini]({0}) untuk melihat detail selengkapnya.",
    "FR" : ":tada: Félicitations ! Votre réponse a réussi notre test CI. Je vais fusionner la <span class='notranslate'>pull request</span> pour vous. S&#39;il vous plaît continuez à relever le défi et profitez de la programmation ! Cliquez [ici]({0}) pour voir plus de détails.",
    "JA" : "：tada：おめでとうございます！あなたの答えは私たちのCIテストに合格しました。 <span class='notranslate'>pull request</span>をマージします。挑戦を続け、プログラミングを楽しんでください！詳細については、[こちら]（{0}）をクリックしてください。",
    "RU" : ": tada: Поздравляю! Ваш ответ прошел наш тест CI. Я солью <span class='notranslate'>pull request</span> за вас. Продолжайте бросать вызов и наслаждайтесь программированием! Нажмите [здесь] ({0}), чтобы увидеть более подробную информацию.",
    "DE" : ":tada: Glückwunsch! Ihre Antwort hat unseren CI-Test bestanden. Ich werde den <span class='notranslate'>pull request</span> für Sie zusammenführen. Bitte fordern Sie weiter und genießen Sie das Programmieren! Klicken Sie [hier]({0}), um weitere Details anzuzeigen.",
    "KO" : ": tada : 축하합니다! 귀하의 답변은 CI 테스트를 통과했습니다. <span class='notranslate'>pull request</span> 를 병합하겠습니다. 계속 도전하고 프로그래밍을 즐기세요! 자세한 내용을 보려면 [여기] ({0})를 클릭하세요.",
    "IT" : ":tada: Congratulazioni! La tua risposta ha superato il nostro test CI. Unirò la <span class='notranslate'>pull request</span> per te. Continua a sfidare e divertiti a programmare! Fare clic [qui]({0}) per visualizzare maggiori dettagli."
  },
  "format" : "HTML"
}, {
  "id" : "YourAnswerFailedCI",
  "data" : {
    "EN" : ":sob: Sorry, your answer seemed not pass our CI test. Don't worry, click [here]({0}) to see more details.\nI absolutely believe you can do better next time!\n",
    "ZH_HANS" : ":sob: 对不起，您的答案似乎没有通过CI测试，请不要气馁，点击[这里]({0})查看原因，再接再厉！\n下次一定可以做得更好！\n",
    "ZH_HANT" : ":sob: 對不起，您的答案似乎沒有通過CI測試，請不要氣餒，點擊[這裡]({0})查看原因，再接再厲！下次一定可以做得更好！",
    "ES" : ": sollozo: Lo siento, su respuesta pareció no pasar nuestra prueba de CI. No se preocupe, haga clic [aquí] ({0}) para ver más detalles. ¡Creo absolutamente que puedes hacerlo mejor la próxima vez!",
    "AR" : ": sob: عذرًا ، يبدو أن إجابتك لم تجتاز اختبار CI الخاص بنا. لا تقلق ، انقر [هنا] ({0}) لمشاهدة المزيد من التفاصيل. أعتقد تمامًا أنه يمكنك القيام بعمل أفضل في المرة القادمة!",
    "PT" : ": sob: Desculpe, sua resposta parecia não ter passado em nosso teste de CI. Não se preocupe, clique [aqui] ({0}) para ver mais detalhes. Eu absolutamente acredito que você pode fazer melhor da próxima vez!",
    "ID" : ":sob: Maaf, jawaban Anda sepertinya tidak lulus tes CI kami. Jangan khawatir, klik [di sini]({0}) untuk melihat detail selengkapnya. Saya benar-benar percaya Anda dapat melakukan yang lebih baik lain kali!",
    "FR" : ":sob: Désolé, votre réponse ne semble pas passer notre test CI. Ne vous inquiétez pas, cliquez [ici]({0}) pour voir plus de détails. Je crois absolument que vous pouvez faire mieux la prochaine fois !",
    "JA" : "：sob：申し訳ありませんが、あなたの回答はCIテストに合格しなかったようです。心配しないでください。詳細を表示するには、[ここ]（{0}）をクリックしてください。次回はもっと上手くできると絶対に信じています！",
    "RU" : ": sob: Извините, ваш ответ не прошел наш тест CI. Не волнуйтесь, нажмите [здесь] ({0}), чтобы увидеть подробности. Я абсолютно верю, что в следующий раз у вас получится лучше!",
    "DE" : ":sob: Entschuldigung, Ihre Antwort schien unseren CI-Test nicht zu bestehen. Keine Sorge, klicken Sie [hier]({0}), um weitere Details anzuzeigen. Ich glaube fest daran, dass du es beim nächsten Mal besser machen kannst!",
    "KO" : ": sob : 죄송합니다. 귀하의 답변은 CI 테스트를 통과하지 못한 것 같습니다. 걱정하지 마세요. 자세한 내용을 보려면 [여기] ({0})를 클릭하세요. 나는 당신이 다음에 더 잘할 수 있다고 절대적으로 믿습니다!",
    "IT" : ":sob: Siamo spiacenti, la tua risposta sembrava non superare il nostro test CI. Non preoccuparti, fai clic [qui]({0}) per visualizzare maggiori dettagli. Credo assolutamente che tu possa fare di meglio la prossima volta!"
  },
  "format" : "HTML"
}, {
  "id" : "YouAreNotAllowedToChange",
  "data" : {
    "EN" : "You are not allowed to change this file: `{0}`",
    "ZH_HANS" : "我们不允许您修改此文件：`{0}`",
    "ZH_HANT" : "我們不允許您修改此文件：`{0}`",
    "ES" : "No se le permite cambiar este archivo: `{0}`",
    "AR" : "لا يسمح لك بتغيير هذا الملف: \"{0}`",
    "PT" : "Você não tem permissão para alterar este arquivo: `{0}`",
    "ID" : "Anda tidak diizinkan untuk mengubah file ini: `{0}`",
    "FR" : "Vous n'êtes pas autorisé à modifier ce fichier : `{0}`",
    "JA" : "このファイルを変更することはできません： `{0}`",
    "RU" : "Вам не разрешено изменять этот файл: `{0}`",
    "DE" : "Sie dürfen diese Datei nicht ändern: `{0}`",
    "KO" : "다음 파일을 변경할 수 없습니다. `{0}`",
    "IT" : "Non sei autorizzato a modificare questo file: `{0}`"
  },
  "format" : "TEXT"
} ]